brew "giflib"
brew "libpng"
brew "bat"
brew "pixman"
brew "cairo"
brew "cloc"
brew "cocoapods"
brew "coreutils"
brew "deno"
brew "diffutils"
brew "eza"
brew "fd"
brew "pango"
brew "ffmpeg"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-delta"
brew "grep"
brew "jpeg"
brew "jq"
brew "librsvg"
brew "node"
brew "optipng"
brew "pkgconf"
brew "pnpm"
brew "postgresql@16", restart_service: :changed, link: true
brew "redis", restart_service: :changed
brew "ripgrep"
brew "wget"
brew "yarn"
brew "yq"
brew "yt-dlp"
cask "alfred"
cask "brave-browser"
cask "cleanshot"
cask "discord"
cask "disk-inventory-x"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "ghostty"
cask "imageoptim"
cask "keycastr"
cask "protonvpn"
cask "rectangle-pro"
cask "slack"
cask "steam"
cask "sublime-text"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zulu@21"

vscode "adpyke.codesnap"
vscode "atishay-jain.all-autocomplete"
vscode "bradlc.vscode-tailwindcss"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.npm-intellisense"
vscode "cnakazawa.dunkel-theme"
vscode "cnakazawa.licht-theme"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot-chat"
vscode "github.copilot"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql-syntax"
vscode "graphql.vscode-graphql"
vscode "johnsoncodehk.vscode-code-spotlight"
vscode "markosth09.color-picker"
vscode "mathiasfrohlich.kotlin"
vscode "meta.relay"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "nhoizey.gremlins"
vscode "oxc.oxc-vscode"
vscode "prisma.prisma"
vscode "rust-lang.rust-analyzer"
vscode "styled-components.vscode-styled-components"
vscode "sysoev.vscode-open-in-github"
vscode "tamasfe.even-better-toml"
vscode "typescriptteam.native-preview"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vunguyentuan.vscode-css-variables"
vscode "wix.vscode-import-cost"
